//Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8). Во зададен опсег (почетокот m и крајот на опегот
// n се цели броеви чија вредност се внесува од тастатура), да се најде и испечати најмалиот „благ број“.
// Ако не постои таков број, да се испечати NE.

#include <stdio.h>

int main()
{
    int m, n;
    int cont = 1;
    scanf("%d%d", &m, &n);
    for(int i = m; i <= n; i++)
    {
        cont = 1;
        for(int j = i; j > 0; j /= 10)
        {
            if(j %2 !=0)
            {
                cont = 0;
                break;
            }
        }
        if(cont == 1)
        {
            printf("%d", i);
            break;
        }
        if(cont == 0 && i == n)
        {
            printf("NE");
        }
    }
    return 0;
}





