//За потребите на професорите и асистентите на ФИНКИ потребно е да напишете програма која ќе врши скалирање на поените на студентите од еден испит.
//Од стандарден влез потребно е да се вчитаат поени од определен испит на најмногу 100 студенти и истите да се зачуваат во низа.
//Да се дефинира функција void scale која ќе прими како аргумент низа од броеви (поени на студентите на испитот). Функцијата потребно е да ги скалира поените на следниот начин:
//Да се најдат максималните поени на испитот (пример 88 од 100)
//Да се пресмета количникот 100/max (пример 100/88 = 1.13636)
//Сите поени од низата да се помножат со овој количник со цел студентот којшто има најмногу поени на испитот да добие 100 поени.
//Да се испечати на екран низата со скалирани поени. Да не се користи помошна низа за решавање на задачата, односно трансформацијата на низата да биде  in-place.

#include <stdio.h>
double max(double *array, int n);
void func(double *array, int n);

int main() {
    int n, i;
    double array[100];
    scanf("%d", &n);

    for (i = 0; i < n; i++)
        scanf("%lf", &array[i]);

    func(array, n);

    for (i = 0; i < n; i++)
        printf("%.2lf ", array[i]);

    return 0;
}


double max(double *array, int n) {
    double max = *array;
    for (int i = 1; i < n; i++) {
        if (*(array + i) > max)
            max = *(array + i);
    }
    return max;
}

void func(double *array, int n) {
    double result = 100 / max(array, n);
    for (int i = 0; i < n; i++) {
        *(array + i) *= result;
    }
}