//Од тастатура се внесува цел број n, а потоа и n тројки природни броеви
//(должини на три отсечки). За секоја тројка должини треба да се испечати
//порака Moze ако со нив може да се конструира триаголник, во спротивно се
//печати Ne moze. На крај да се испечати редниот број на тројката броеви со која
//се конструира триаголникот со најголем периметар (се земаат предвид само
//тројките со кои може да се конструира триаголник), како и вредноста на
//најголемиот периметар. Ако постојат повеќе такви тројки броеви, да се
//испечати редниот број на последната. Се смета дека првата внесена тројка е со
//реден број еден, втората со реден број два итн.

#include <stdio.h>
int main() {

    int n;
    int a,b,c,l,max_l = 0;
    int max_index = 0;
    scanf("%d",&n);
    for (int i;i < n; i++){
        scanf("%d %d %d",&a ,&b, &c);
        if((a+b > c) && (a+c > b) && (c+b > a)) {
            printf("Moze\n");
            l = a + b + c;
            if (l >= max_l) {
                max_l = l;
                max_index = i;
            }
        }
            else {
                printf("Nemoze\n");
            }

        }
    printf("Najgolem perimetar e :  %d, so reden broj : %d\n",max_l,max_index+1);
    return 0;
}
